{
  "symptoms": [
    {"name": "itching", "description": "A tingling or irritating sensation on the skin that makes one want to scratch."},
    {"name": "skin_rash", "description": "A visible change in the skin's color or texture, often due to irritation or infection."},
    {"name": "nodal_skin_eruptions", "description": "Raised, swollen lumps on the skin caused by infection, inflammation, or allergies."},
    {"name": "continuous_sneezing", "description": "Repeated involuntary expulsion of air from the nose due to irritation."},
    {"name": "shivering", "description": "Uncontrolled muscle contractions that result in shaking, often due to cold or fever."},
    {"name": "chills", "description": "Sudden cold sensation accompanied by shivering, usually due to fever or infection."},
    {"name": "watering_from_eyes", "description": "Excessive tear production due to irritation, allergies, or infection."},
    {"name": "blocked_nose", "description": "Difficulty breathing through the nose due to congestion or swelling."},
    {"name": "runny_nose", "description": "Excess mucus discharge from the nasal passages, often due to a cold or allergies."},
    {"name": "cough", "description": "A reflex action to clear the throat and airways of mucus or irritants."},
    {"name": "hoarse_voice", "description": "A rough, raspy, or strained voice due to throat irritation or overuse."},
    {"name": "sore_throat", "description": "Pain or discomfort in the throat, often due to infection or inflammation."},
    {"name": "feeling_unwell", "description": "A general sensation of discomfort or mild illness."},
    {"name": "high_fever", "description": "Abnormally elevated body temperature, often a sign of infection."},
    {"name": "muscle_pain", "description": "Discomfort or aching in the muscles, often caused by strain, infection, or illness."},
    {"name": "loss_of_taste", "description": "Reduced or absent ability to perceive flavors in food and drinks."},
    {"name": "loss_of_smell", "description": "Inability or reduced ability to detect odors."},
    {"name": "vomiting", "description": "Forceful expulsion of stomach contents through the mouth due to illness or discomfort."},
    {"name": "dehydration", "description": "A condition resulting from excessive loss of body fluids."},
    {"name": "diarrhea", "description": "Frequent, loose, or watery bowel movements."},
    {"name": "sunken_eyes", "description": "Hollow or deep-set appearance of the eyes, often due to dehydration or illness."},
    {"name": "chest_pain", "description": "Discomfort or pain in the chest, which may be related to the heart, lungs, or muscles."},
    {"name": "upset_stomach", "description": "A feeling of discomfort, nausea, or bloating in the stomach area."},
    {"name": "headache", "description": "Pain or discomfort in the head, scalp, or neck region."},
    {"name": "fatigue", "description": "Extreme tiredness or exhaustion due to illness, stress, or lack of sleep."},
    {"name": "wheezing", "description": "A high-pitched whistling sound while breathing, often due to narrowed airways."},
    {"name": "breathlessness", "description": "Difficulty breathing or shortness of breath."},
    {"name": "tight_chest", "description": "A feeling of pressure or constriction in the chest area."},
    {"name": "persistent_cough", "description": "A cough that lasts for weeks and does not easily go away."},
    {"name": "family_history", "description": "A record of diseases or conditions present in close relatives."},
    {"name": "dizziness", "description": "A sensation of lightheadedness or unsteadiness."},
    {"name": "difficulty_breathing", "description": "A struggle or discomfort in drawing breath, often a sign of respiratory issues."},
    {"name": "abnormal_heart_rhythm", "description": "Irregular, too fast, or too slow heartbeats."},
    {"name": "blurred_vision", "description": "A lack of sharpness in vision, making objects appear unclear or fuzzy."},
    {"name": "loss_of_balance", "description": "An inability to maintain stability or control body movement."},
    {"name": "anxiety", "description": "A state of nervousness, worry, or fear about uncertain outcomes."},
    {"name": "nausea", "description": "A feeling of unease or discomfort in the stomach with an urge to vomit."},
    {"name": "tinnitus", "description": "Hearing ringing, buzzing, or other noises in the ears without an external source."},
    {"name": "nosebleeds", "description": "Bleeding from the nasal cavity due to injury, dryness, or other factors."},
    {"name": "lethargy", "description": "A state of tiredness, sluggishness, or lack of energy."},
    {"name": "excessive_hunger", "description": "A frequent and strong desire to eat food."},
    {"name": "increased_appetite", "description": "An unusual rise in hunger levels and food intake."},
    {"name": "often_thirsty", "description": "A frequent and excessive need to drink fluids."},
    {"name": "blurred_and_distorted_vision", "description": "Visual impairment where objects appear unclear and misshapen."},
    {"name": "weight_loss", "description": "Unintentional reduction in body weight, often due to illness or metabolic conditions."},
    {"name": "obesity", "description": "A condition characterized by excessive accumulation of body fat, leading to health risks."},
    {"name": "loss_of_appetite", "description": "Reduced desire to eat, often due to illness or stress."},
    {"name": "malaise", "description": "A general feeling of discomfort, weakness, or illness."},
    {"name": "red_spots_over_body", "description": "Small, red skin lesions caused by various infections or allergies."},
    {"name": "spots_over_body_fill_with_fluid", "description": "Blisters filled with fluid appearing on the skin, often due to infection."},
    {"name": "itchy_blisters", "description": "Small, fluid-filled sores on the skin that cause itching and discomfort."},
    {"name": "spots_over_body_leak_fluid", "description": "Blisters that burst and release fluid due to irritation or infection."},
    {"name": "swelled_lymph_nodes", "description": "Enlarged lymph nodes due to infection, inflammation, or other conditions."},
    {"name": "prolonged_cough", "description": "Persistent coughing lasting more than three weeks."},
    {"name": "yellowing_of_eyes", "description": "Yellow discoloration of the white part of the eyes, often due to jaundice."},
    {"name": "sweating", "description": "Excessive perspiration due to heat, exertion, or medical conditions."},
    {"name": "phlegm", "description": "Thick mucus produced in the respiratory tract, often during illness."},
    {"name": "night_sweats", "description": "Excessive sweating during sleep, often due to infection or other medical conditions."},
    {"name": "blood_in_sputum", "description": "Presence of blood in coughed-up mucus, indicating respiratory issues."},
    {"name": "fast_heart_rate", "description": "Heart beating faster than normal, also known as tachycardia."},
    {"name": "rusty_sputum", "description": "Mucus with a reddish-brown color, often a sign of pneumonia."},
    {"name": "aching_body", "description": "Generalized body pain often associated with infections or fatigue."},
    {"name": "weight_gain", "description": "Increase in body weight, potentially due to diet, lifestyle, or medical conditions."},
    {"name": "joint_pain", "description": "Pain in one or more joints, often due to arthritis or injury."},
    {"name": "dry_skin", "description": "Skin lacking moisture, leading to roughness or flaking."},
    {"name": "swollen_extremeties", "description": "Enlargement of hands, feet, or limbs due to fluid retention or inflammation."},
    {"name": "cold_hands_and_feets", "description": "Reduced blood flow causing hands and feet to feel unusually cold."},
    {"name": "enlarged_thyroid", "description": "Swelling of the thyroid gland, also known as a goiter."},
    {"name": "muscle_cramps", "description": "Sudden, involuntary contractions of muscles causing pain."},
    {"name": "abnormal_menstruation", "description": "Irregular, heavy, or absent menstrual periods."},
    {"name": "slowed_heart_rate", "description": "Heart beating slower than normal, also known as bradycardia."},
    {"name": "stiff_neck", "description": "Reduced neck movement due to pain or tension."},
    {"name": "painful_walking", "description": "Discomfort or pain while walking, often due to injury or arthritis."},
    {"name": "muscle_weakness", "description": "Reduced muscle strength affecting movement and function."},
    {"name": "swelling_joints", "description": "Enlargement of joints due to inflammation or fluid buildup."},
    {"name": "inflammation_joint", "description": "Swelling, pain, and redness in a joint due to infection or arthritis."},
    {"name": "warm_red_skin_over_the_affected_joint", "description": "Increased warmth and redness of the skin over an inflamed joint."},
    {"name": "continuous_feel_of_urine", "description": "Persistent urge to urinate even when the bladder is empty."},
    {"name": "lower_belly_pain", "description": "Pain in the lower abdominal region, often due to digestive or urinary issues."},
    {"name": "burning_micturition", "description": "Painful or burning sensation while urinating, often due to infection."},
    {"name": "pain_when_peeing", "description": "Discomfort or pain during urination, commonly due to infections."},
    {"name": "frequent_urination", "description": "Needing to urinate more often than usual, possibly due to infection or diabetes."},
    {"name": "bladder_discomfort", "description": "Pain or pressure in the bladder region, often linked to infection or irritation."},
    {"name": "cloudy_urine", "description": "Urine with a murky appearance, possibly due to infection or kidney issues."},
    {"name": "foul_smelling_urine", "description": "Unusually strong or bad odor in urine, often due to infection or dehydration."},
    {"name": "blood_in_urine", "description": "Presence of blood in urine, also known as hematuria."},
    {"name": "skin_peeling", "description": "Shedding of the outer layer of skin, often due to irritation or infection."},
    {"name": "silver_like_dusting", "description": "Scaly, silver-colored patches on the skin, often seen in psoriasis."},
    {"name": "small_dents_in_nails", "description": "Tiny depressions in the nails, commonly due to psoriasis or other conditions."},
    {"name": "inflammatory_nails", "description": "Redness and swelling around the nails, often due to infection."},
    {"name": "itchy_skin", "description": "Persistent irritation and urge to scratch the skin."},
    {"name": "insomnia", "description": "Difficulty falling or staying asleep, leading to tiredness."},
    {"name": "swollen_ankles", "description": "Enlarged ankles due to fluid retention or poor circulation."},
    {"name": "erectile_dysfunction", "description": "Inability to achieve or maintain an erection."},
    {"name": "stiffness", "description": "Reduced flexibility and movement in joints or muscles."},
    {"name": "skin_change", "description": "Unusual alterations in skin color, texture, or condition."},
    {"name": "fever", "description": "Elevated body temperature, often due to infection or illness."},
    {"name": "shortness_of_breath", "description": "Difficulty breathing or feeling breathless."},
    {"name": "numbness", "description": "Loss of sensation or feeling in a body part."},
    {"name": "memory_loss", "description": "Inability to recall information or events as expected."},
    {"name": "trouble_walking", "description": "Difficulty maintaining balance or movement while walking."},
    {"name": "trouble_speaking", "description": "Difficulty in articulating words or forming sentences."},
    {"name": "feeling_dizzy", "description": "Sensation of lightheadedness or unsteadiness."},
    {"name": "falling_over", "description": "Unexpected loss of balance leading to a fall."},
    {"name": "facial_paralysis", "description": "Loss of muscle movement in the face, often due to nerve damage."},
    {"name": "arm_paralysis", "description": "Loss of muscle function in one or both arms."},
    {"name": "leg_paralysis", "description": "Inability to move one or both legs due to nerve or muscle damage."},
    {"name": "angina", "description": "Chest pain due to reduced blood flow to the heart."},
    {"name": "cold_sweat", "description": "Sudden sweating unrelated to heat or exertion, often due to shock or stress."},
    {"name": "tummy_pain", "description": "Discomfort or ache in the abdominal region."},
    {"name": "blood_in_stool", "description": "Presence of blood in bowel movements, indicating possible digestive issues."},
    {"name": "mucus_in_stool", "description": "Excessive mucus in bowel movements, often due to digestive problems."},
    {"name": "extreme_tiredness", "description": "Severe fatigue that affects daily activities."},
    {"name": "indigestion", "description": "Discomfort in the upper abdomen, often due to difficulty digesting food."}
  ]
}
