{
  "symptoms": [
    {"name": "nasal_congestion", "description": "A stuffy feeling in the nose due to swollen nasal tissues or excess mucus."},
    {"name": "itchy_eyes", "description": "A sensation of irritation or discomfort in the eyes prompting a desire to rub them."},
    {"name": "chills", "description": "A feeling of coldness accompanied by shivering, often signaling a fever or infection."},
    {"name": "watering_from_eyes", "description": "Excessive tear production causing tears to spill over from the eyes."},
    {"name": "shivering", "description": "Involuntary trembling of the body, typically due to cold or fever."},
    {"name": "skin_rash", "description": "A visible change in the skin's color or texture, often due to irritation or infection."},
    {"name": "continuous_sneezing", "description": "Frequent, uncontrollable sneezes triggered by nasal irritation or allergens."},
    {"name": "anaphylaxis", "description": "A severe, life-threatening allergic reaction causing swelling, breathing difficulty, and shock."},
    {"name": "blocked_nose", "description": "An obstruction in the nasal passages making it hard to breathe through the nose."},
    {"name": "runny_nose", "description": "Excess mucus discharge from the nose, often clear, watery, or thick."},
    {"name": "cough", "description": "A sudden expulsion of air from the lungs to clear the throat or airways."},
    {"name": "hoarse_voice", "description": "A rough, raspy, or strained voice due to irritation or infection of the vocal cords."},
    {"name": "sore_throat", "description": "Pain, scratchiness, or irritation in the throat, often worse when swallowing."},
    {"name": "feeling_unwell", "description": "A general sense of discomfort or sickness without specific symptoms."},
    {"name": "high_fever", "description": "An elevated body temperature above normal, often indicating infection or illness."},
    {"name": "muscle_pain", "description": "Aching or soreness in the muscles due to tension, injury, or illness."},
    {"name": "loss_of_taste", "description": "An inability to detect flavors, often linked to illness or nerve issues."},
    {"name": "loss_of_smell", "description": "A reduced or absent ability to perceive odors, commonly associated with colds or infections."},
    {"name": "lethargy", "description": "A state of extreme tiredness or lack of energy, making one feel sluggish."},
    {"name": "excessive_hunger", "description": "An unusually strong desire to eat, often linked to metabolic changes."},
    {"name": "increased_appetite", "description": "A heightened urge to consume food beyond normal levels."},
    {"name": "often_thirsty", "description": "A frequent need to drink due to persistent dryness in the mouth or throat."},
    {"name": "blurred_and_distorted_vision", "description": "Unclear or warped eyesight that affects visual perception."},
    {"name": "weight_loss", "description": "An unintentional reduction in body weight, often tied to illness or malnutrition."},
    {"name": "obesity", "description": "Excessive body fat accumulation that may impact overall health."},
    {"name": "vomiting", "description": "The forceful expulsion of stomach contents through the mouth."},
    {"name": "diarrhea", "description": "Frequent, loose, or watery bowel movements indicating digestive distress."},
    {"name": "fatigue", "description": "A persistent feeling of exhaustion or lack of energy despite rest."},
    {"name": "wheezing", "description": "A high-pitched whistling sound during breathing, often due to narrowed airways."},
    {"name": "shortness_of_breath", "description": "Difficulty breathing or a feeling of not getting enough air."},
    {"name": "chest_tightness", "description": "A sensation of pressure or constriction in the chest, often linked to respiratory or heart issues."},
    {"name": "dizziness", "description": "A sensation of unsteadiness or spinning, often affecting balance."},
    {"name": "difficulty_breathing", "description": "Labored or strained breathing that feels insufficient or painful."},
    {"name": "blurred_vision", "description": "A loss of sharpness in eyesight, making objects appear hazy."},
    {"name": "loss_of_balance", "description": "Difficulty maintaining stability, often leading to unsteadiness or falls."},
    {"name": "nausea", "description": "A queasy feeling in the stomach that may precede vomiting."},
    {"name": "tinnitus", "description": "A ringing, buzzing, or other noise in the ears without an external source."},
    {"name": "nosebleeds", "description": "Bleeding from the nose due to irritation, injury, or dry air."},
    {"name": "prolonged_cough", "description": "A persistent cough lasting weeks, often indicating an underlying condition."},
    {"name": "yellowing_of_eyes", "description": "A yellowish tint in the whites of the eyes, often a sign of liver issues."},
    {"name": "sweating", "description": "Excessive perspiration, sometimes unrelated to heat or activity."},
    {"name": "night_sweats", "description": "Intense sweating during sleep, often linked to infection or hormonal changes."},
    {"name": "blood_in_sputum", "description": "Coughing up phlegm tinged with blood, possibly indicating lung issues."},
    {"name": "rusty_sputum", "description": "Phlegm with a reddish-brown color, often linked to infection or blood."},
    {"name": "breathlessness", "description": "A sensation of being unable to catch one’s breath, often sudden or severe."},
    {"name": "phlegm", "description": "Thick mucus produced in the respiratory system, often coughed up."},
    {"name": "weight_gain", "description": "An increase in body weight, potentially due to fluid retention or overeating."},
    {"name": "cold_intolerance", "description": "An unusual sensitivity or discomfort in cold temperatures."},
    {"name": "dry_skin", "description": "Rough, flaky, or tight skin lacking moisture."},
    {"name": "hair_loss", "description": "Unusual shedding or thinning of hair from the scalp or body."},
    {"name": "cold_hands_and_feet", "description": "Persistently cold extremities, often due to poor circulation."},
    {"name": "slow_movements", "description": "Reduced speed or coordination in physical actions."},
    {"name": "slow_thoughts", "description": "Delayed or sluggish mental processing and decision-making."},
    {"name": "joint_pain", "description": "Aching or discomfort in the joints, often worsened by movement."},
    {"name": "stiffness", "description": "A feeling of rigidity or reduced flexibility in muscles or joints."},
    {"name": "deformity", "description": "An abnormal shape or structure in a body part, often due to injury or disease."},
    {"name": "morning_stiffness", "description": "Joint or muscle rigidity felt particularly upon waking."},
    {"name": "painful_walking", "description": "Discomfort or pain in the legs or feet while moving."},
    {"name": "inflammation_joint", "description": "Swelling and tenderness in a joint due to irritation or disease."},
    {"name": "dysuria", "description": "Pain or burning sensation during urination."},
    {"name": "urinary_frequency", "description": "An increased need to urinate more often than usual."},
    {"name": "continuous_feel_of_urine", "description": "A persistent sensation of needing to urinate despite emptying the bladder."},
    {"name": "cloudy_urine", "description": "Urine that appears murky or opaque, often signaling infection."},
    {"name": "blood_in_urine", "description": "Visible or microscopic blood in the urine, indicating potential issues."},
    {"name": "foul_smelling_urine", "description": "Urine with an unpleasant odor, often linked to infection or dehydration."},
    {"name": "bladder_discomfort", "description": "Pain or pressure in the bladder area, often with urination issues."},
    {"name": "flank_pain", "description": "Discomfort or pain in the side of the body, near the kidneys."},
    {"name": "hematuria", "description": "The presence of blood in the urine, either visible or microscopic."},
    {"name": "lower_belly_pain", "description": "Aching or cramping in the lower abdomen, often tied to digestive or urinary issues."},
    {"name": "itching_irritation", "description": "A tingling or uncomfortable sensation on the skin prompting scratching."},
    {"name": "redness_inflammation", "description": "Red, swollen skin indicating irritation or infection."},
    {"name": "plaque_scaly_patches", "description": "Thick, scaly areas of skin, often linked to conditions like psoriasis."},
    {"name": "swelling_edema", "description": "Fluid buildup causing puffiness or swelling in tissues."},
    {"name": "muscle_cramps", "description": "Sudden, painful tightening of muscles, often due to fatigue or dehydration."},
    {"name": "numbness", "description": "A loss of sensation or tingling in a body part."},
    {"name": "digestive_issues", "description": "Problems with the stomach or intestines, such as pain or irregular bowel movements."},
    {"name": "leg_paralysis", "description": "Loss of movement or strength in the legs due to nerve or muscle damage."},
    {"name": "vision_impairment", "description": "Reduced or abnormal eyesight affecting clarity or field of view."},
    {"name": "arm_paralysis", "description": "Inability to move or control the arms due to nerve or muscle issues."},
    {"name": "confusion", "description": "Difficulty thinking clearly or understanding surroundings."},
    {"name": "trouble_speaking", "description": "Impaired ability to form words or communicate verbally."},
    {"name": "facial_paralysis", "description": "Loss of muscle control on one side of the face, often drooping."},
    {"name": "cold_sweat", "description": "Clammy, cool perspiration often linked to stress or illness."},
    {"name": "rapid_or_irregular_heartbeat", "description": "A heart rate that is unusually fast or erratic."},
    {"name": "angina", "description": "Chest pain or discomfort due to reduced blood flow to the heart."},
    {"name": "throbbing_headache", "description": "A pulsating or pounding pain in the head."},
    {"name": "sensitivity_to_light", "description": "Discomfort or pain in the eyes when exposed to bright light."},
    {"name": "visual_disturbances", "description": "Abnormalities in vision, such as flashes or blind spots."},
    {"name": "sensitivity_to_sound", "description": "Heightened discomfort or pain from normal levels of noise."},
    {"name": "urinary_urgency", "description": "A sudden, strong need to urinate with little warning."},
    {"name": "fever", "description": "An elevated body temperature, often a response to infection or inflammation."},
    {"name": "bloating", "description": "A feeling of fullness or swelling in the abdomen due to gas or fluid."},
    {"name": "gas_flatulence", "description": "Excessive gas in the digestive tract leading to burping or passing wind."},
    {"name": "mucus_in_stool", "description": "Visible mucus in bowel movements, often indicating irritation or infection."},
    {"name": "reduced_range_of_motion", "description": "Limited ability to move a joint or limb fully."},
    {"name": "joint_tenderness", "description": "Pain or sensitivity when a joint is touched or moved."},
    {"name": "crepitus", "description": "A crackling or grinding sound in a joint during movement."},
    {"name": "weak_muscles", "description": "Reduced strength or power in muscles, affecting movement."},
    {"name": "joint_buckling", "description": "Sudden giving way or collapse of a joint under pressure."},
    {"name": "bruising_more_easily", "description": "Increased tendency to develop bruises from minor impacts."},
    {"name": "frequent_infections", "description": "Recurring illnesses or infections due to a weakened immune system."},
    {"name": "pulsatile_tinnitus", "description": "A rhythmic whooshing or pulsing sound in the ears, often tied to blood flow."},
    {"name": "muscle_joint_pain", "description": "Aching or soreness affecting both muscles and joints."},
    {"name": "bleeding_gums_nose", "description": "Spontaneous bleeding from the gums or nose, often linked to clotting issues."},
    {"name": "swollen_lymph_nodes", "description": "Enlarged glands in the neck, armpits, or groin due to infection or inflammation."},
    {"name": "skin_rash_scarlet_fever", "description": "A red, sandpaper-like rash associated with scarlet fever infection."},
    {"name": "white_patches_on_tonsils", "description": "White spots or coating on the tonsils, often due to infection."},
    {"name": "red_swollen_tonsils", "description": "Inflamed, reddish tonsils indicating infection or irritation."},
    {"name": "excess_mucus_production", "description": "Overproduction of mucus in the respiratory tract, often leading to congestion."},
    {"name": "frequent_respiratory_infections", "description": "Recurring infections affecting the lungs or airways."},
    {"name": "swelling_in_ankles_feet_legs", "description": "Fluid buildup causing puffiness in the lower extremities."},
    {"name": "palpitations", "description": "A noticeable, often rapid or irregular heartbeat felt in the chest."},
    {"name": "fainting_syncope", "description": "A sudden, temporary loss of consciousness due to reduced blood flow to the brain."},
    {"name": "irregular_heartbeat", "description": "An abnormal rhythm of the heart, either too fast, slow, or erratic."},
    {"name": "persistent_cough", "description": "A long-lasting cough that does not resolve quickly."},
    {"name": "eye_irritation", "description": "Discomfort, redness, or itching in the eyes due to allergens or infection."},
    {"name": "kidney_problems", "description": "Issues with kidney function, often causing pain, swelling, or urinary changes."},
    {"name": "photosensitivity", "description": "An abnormal reaction of the skin or eyes to sunlight or bright light."},
    {"name": "epigastric_pain", "description": "Pain in the upper central abdomen, often linked to stomach or digestive issues."},
    {"name": "hematemesis", "description": "Vomiting blood, indicating potential bleeding in the upper digestive tract."},
    {"name": "melena", "description": "Dark, tarry stools due to digested blood from gastrointestinal bleeding."},
    {"name": "jaundice", "description": "Yellowing of the skin and eyes caused by liver dysfunction or bile buildup."}
  ]
}